[
  {
    "lang": "en-US",
    "pages": {
      "index": {
        "lang": "en-US",
        "titleSize": "50",
        "theatreSize": "42",
        "paraHeight": "1.6",
        "theatreParam": "{ maxSpeed: 100 }",
        "typingFunc": ".addScene('product designers', 1800, -17, 800)\n          .addScene('UI designers', 1800, -12, 800)\n          .addScene('UX designers', 1800, -12, 800)\n          .addScene('product managers', 1800, -16, 800)\n          .addScene('FE developers', 1800, -13, 800)",
        "typingInvoke": ".addActor('line2', { speed: 1, accuracy: 1 })\n        .addScene(2600)\n        .addScene('line2:For ', 500)",
        "1": "A Desktop UI Library",
        "2": "Element, a Vue 2.0 based component library for developers, designers and product managers",
        "3": "Guide",
        "4": "Understand the design guidelines, helping designers build product that's logically sound, reasonably structured and easy to use.",
        "5": "View Detail",
        "6": "Component",
        "7": "Experience interaction details by strolling through component demos. Use encapsulated code to improve developing efficiency.",
        "8": "Resource",
        "9": "Download relevant design resources for shaping page prototype or visual draft, increasing design efficiency."
      },
      "component": {},
      "changelog": {
        "1": "Changelog",
        "2": "en-US"
      },
      "nav": {
        "1": "Navigation",
        "2": "Navigation focuses on solving the users' problems of where to go and how to get there. Generally it can be categorized into 'sidebar navigation' and 'top navigation'.",
        "3": "Choose the right navigation",
        "4": "An appropriate navigation gives users a smooth experience, while an inappropriate one leads to confusion. Here are the differences between sidebar navigation and top navigation",
        "5": "Side Navigation",
        "6": "Fix the navigation at the left edge, thus improves its visibility, making it easier to switch between pages. In this case, the top area of the page holds commonly used tools, e.g. search bar, help button, notice button, etc. Suitable for background management or utility websites.",
        "7": "Level 1 categories",
        "8": "Suitable for simply structured sites with only one level of pages. No breadcrumb is needed.",
        "9": "Level 2 categories",
        "10": "Sidebar displays up to two levels of navigation. Breadcrumbs are recommended in combination of second level navigation, making it easier for the users to locate and navigate.",
        "11": "Level 3 categories",
        "12": "Suitable for complicated utility websites. The left sidebar holds first level navigation, and the middle column displays second level navigation or other utility options.",
        "13": "Top Navigation",
        "14": "Conforms to the normal browsing order from top to bottom, which makes things more natural. The navigation amount and text length are limited to the width of the top.",
        "15": "Suitable for sites with few navigations and large chunks."
      },
      "resource": {
        "paraHeight": "1.6",
        "1": "Resource",
        "2": "Here you can download design resources and tools that shaped Element UI. More design resources are being prepared.",
        "3": "Axure Components",
        "4": "By importing Element UI in Axure, you can easily apply all the components we provide during interaction design.",
        "5": "Download",
        "6": "Sketch Template",
        "7": "Apply components from Element template, so you can improve design efficiency while keeping a unified visual style.",
        "8": "Interaction Design Documentation",
        "9": "Take a closer look at the interaction design documentation. Learn more details of each component from a microcosmic perspective."
      }
    }
  }
]
